/*

  ******************************************************************************
  * @file 			( фаил ):   LCD1602_Font_Cyrillic.c
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):	author: Golinskiy Konstantin	e-mail: golinskiy.konstantin@gmail.com
  ******************************************************************************
  
*/

/* Includes ----------------------------------------------------------*/
#include "LCD1602.h"

#ifdef	FONT_CYRILLIC

	const uint8_t Font_Cyrillic[] = {
	
		//- Russian font windows1251 ---------------------------------------------------  
				
		0x41,  	// А		// 192 символ по ASCII  // 0 эллемент
		0xA0, 	// Б 
		0x42, 	// В
		0xA1, 	// Г
		0xE0, 	// Д
		0x45, 	// Е
		0xA3, 	// Ж
		0xA4, 	// З
		0xA5, 	// И
		0xA6, 	// Й
		0x4B, 	// К
		0xA7, 	// Л
		0x4D, 	// М
		0x48, 	// Н
		0x4F, 	// О
		0xA8, 	// П
		0x50, 	// Р
		0x43, 	// С
		0x54, 	// Т
		0xA9, 	// У
		0xAA, 	// Ф
		0x58, 	// Х
		0xD6, 	// Ц
		0xAB, 	// Ч
		0xAC, 	// Ш
		0xE2, 	// Щ
		0xAD, 	// Ъ
		0xAE, 	// Ы
		0x62, 	// Ь
		0xAF, 	// Э
		0xB0, 	// Ю
		0xB1, 	// Я	// 31 эллемент

		0x61, 	// а	// 32 эллемент
		0x0D, 	// б
		0xB3, 	// в
		0xB4, 	// г
		0xE3, 	// д
		0x65, 	// е
		0xB6, 	// ж
		0xB7, 	// з
		0xB8, 	// и
		0xB9, 	// й
		0xBA, 	// к
		0xBB, 	// л
		0xBC, 	// м
		0xBD, 	// н
		0x6F, 	// о
		0xBE, 	// п
		0x70, 	// р
		0x63, 	// с
		0xBF, 	// т
		0x79, 	// у
		0xAA, 	// ф
		0x78, 	// х
		0xE5, 	// ц
		0xC0, 	// ч
		0xC1, 	// ш
		0xE6, 	// щ
		0xC2, 	// ъ
		0xC3, 	// ы
		0xC4, 	// ь
		0xC5, 	// э
		0xC6, 	// ю		
		0xC7, 	// я	// 255 символ по ASCII		// 63 эллемент 

		//--  end RUS --------------------------------------------------------------

		//////////  спец символы и символы которые не включены в указанные выше диапазон таблицы  /////
			
		////// символы буквы Ё и ё отдельно  //// -------------------------------------------- 
		0xA2,   // Ё 	( рисуем Е ) // 168 символ по ASCII  - 64 эллемент
		0xB5, 	// ё	( рисуем ё ) // 184 символ по ASCII  - 65 эллемент
		//------------------------------------------------------------------------------------

		////// символы Украинской раскладки Іі Її Єє отдельно  //// --------------------------------------------
		0x0E,   // Є 	// 170 символ по ASCII  - 66 эллемент
		0x0C,   // Ї 	// 175 символ по ASCII  - 67 эллемент
		0x49,   // І 	// 178 символ по ASCII  - 68 эллемент

		0x69, 	// і	// 179 символ по ASCII  - 69 эллемент
		0x0F, 	// є	// 186 символ по ASCII  - 70 эллемент
		0x0D, 	// ї	// 191 символ по ASCII  - 71 эллемент
		//------------------------------------------------------------------------------------

	};

#endif

//----------------------------------------------------------------------------------

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
